sim-steady-compressible/0.orig/p_rgh
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

"procBoundary.*"
{
    type            processor;
    value           uniform 0;
}

    inlet
    {
	 type            fixedFluxPressure;
    //   type            zeroGradient;
    }

    outlet
    {
    //  type            zeroGradient;
	 type            fixedValue;
     value           uniform -1000;
    }

    top
    {
        // type            zeroGradient;
        type            symmetryPlane;
        type            cyclic;
    }

    bottom
    {
        // type            zeroGradient;
        type            symmetryPlane;
        type            cyclic;
    }

    front
    {
        // type            zeroGradient;
        type            symmetryPlane;
        type            cyclic;
    }

    back
    {
        // type            zeroGradient;
        type            symmetryPlane;
        type            cyclic;
    }

    media
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
