sim-steady-compressible/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|p_rgh)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }

    "(pFinal|p_rghFinal)"
    {
        $p;
        tolerance       1e-10;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
      solver          smoothSolver;
       smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-10;
    }
}

SIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p               1e-8;
        U               1e-8;
    }

}

relaxationFactors
{
    fields
    {
        p               0.3;
        p_rgh           0.3;
    }
    equations
    {
        U               0.7;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
