sim-steady-compressible/system/volumeAverageFunctions.in
box_000
{ 
	 type 	 volFieldValue; 
	 libs 	 (fieldFunctionObjects); 
	 writeControl 	 timeStep; 
	 writeInterval 	 1; 
	 writeFields 	 false; 
	 regionType 	 cellZone; 
	 name 	 box_000;
	 operation 	 volIntegrate; 
	 fields 
	( 
	 	 rho 
	 	 mass_flux 
	 	 div_u 
	 	 div_u_rho 
	 	 div_stress_term_dev 
	 	 div_stress_term_dev_macro 
		 grad_p
	 	 ddt_u 
	 	 ddt_rho 
	 	 ddt_u_rho 
		 stress_term
		 div_stress_t
		 adv
		 momentErr
	 ); 
} 
 
